{"pageContext":{"group":[{"node":{"id":"9167401d-1067-5407-9e86-7a74adf8e411","parent":{"name":"Segment","sourceInstanceName":"content"},"excerpt":"A  Segment  is a group of options, presented as buttons. Only one option may be selected at once. Props Prop Type Default Notes value string null The selected option. options string [] [] The Segment’s options. disabled boolean false validation…","frontmatter":{"path":null,"title":"","date":null,"tags":null}}},{"node":{"id":"a557be39-713d-5f2b-bc38-56a05a7943f5","parent":{"name":"RadioGroup","sourceInstanceName":"content"},"excerpt":"A  RadioGroup  takes a set of options and turns them into a set of  RowItem s, each of which displays the option together with a  Radio . The RadioGroup’s value is the currently selected option. Props Prop Type Default Notes options string[] [\"Paris…","frontmatter":{"path":null,"title":"","date":null,"tags":null}}},{"node":{"id":"172a9a2c-d543-52b9-b680-163fda776369","parent":{"name":"Radio","sourceInstanceName":"content"},"excerpt":"Tapping on a  Radio  will turn it on. Radio inputs are normally used as a group in order to capture a mutually-exclusive choice, as is done in the  RadioGroup  component. Props Prop Type Default Notes value boolean false Whether the Radio is checked…","frontmatter":{"path":null,"title":"","date":null,"tags":null}}},{"node":{"id":"6f2139bf-a403-55a6-91a1-5d01bdfdc0b3","parent":{"name":"NavigationBar","sourceInstanceName":"content"},"excerpt":"A  NavigationBar  models the top navigation bar of an iOS app. The bar has a title, an optional subtitle, and two tappable areas on its left and right sides. Each of these areas may have a link, icon or both. The bar has a taller “large” mode that…","frontmatter":{"path":null,"title":"","date":null,"tags":null}}},{"node":{"id":"9a097ea6-e9b1-56e1-b5a7-25c2befea95f","parent":{"name":"Image","sourceInstanceName":"content"},"excerpt":"An  Image  shows an image with an optional color overlay. It may also have a  Favorite . Props Prop Type Default Notes image string null A source URL for the Image's image. overlay boolean true color string colors.Primary A color to use for the image…","frontmatter":{"path":null,"title":"","date":null,"tags":null}}},{"node":{"id":"1fa7977c-49a2-52f6-b6dd-0c7bf6da602d","parent":{"name":"Link","sourceInstanceName":"content"},"excerpt":"A  Link  displays either text or an icon. It can be tapped and will run an  onTap  callback when tapped. Props Prop Type Default Notes text string \"Get Started!” icon string ”none\" The name of the icon to display (see  Icon  below). type string…","frontmatter":{"path":null,"title":"","date":null,"tags":null}}},{"node":{"id":"5ef731a7-7f5a-52d4-9785-6aa21822bd8d","parent":{"name":"Inputs","sourceInstanceName":"content"},"excerpt":"Value Each of the input components in the Learn package accept a  value  prop. We can use this prop to set the initial value of the input, or to sync its value with another part of our project’s state. Different input components have values of…","frontmatter":{"path":null,"title":"","date":null,"tags":null}}},{"node":{"id":"d7ee211c-cdd0-5793-b4f2-f424bc22bd02","parent":{"name":"Home","sourceInstanceName":"content"},"excerpt":"Welcome to the  Learn Design System  docs. In this wiki, you’ll find information on each component included in the Learn Design System, together with information on colors, inputs and patterns of use. Installation Open Framer X Store and  install the…","frontmatter":{"path":null,"title":"","date":null,"tags":null}}},{"node":{"id":"9e01da16-5d62-58f6-8597-2e5815cdf9cd","parent":{"name":"Icon","sourceInstanceName":"content"},"excerpt":"An  Icon  displays a Material Design Icon. Props Prop Type Default Notes icon string \"camera” A Material Design Icon name. See  Icon  below. color string colors.Primary Any color. size number 24 The size of the icon. Icon The  icon  prop can accept…","frontmatter":{"path":null,"title":"","date":null,"tags":null}}},{"node":{"id":"3a6e2366-4f66-5085-bf00-8e1277b5ae9a","parent":{"name":"Interactive","sourceInstanceName":"content"},"excerpt":"","frontmatter":{"path":null,"title":"","date":null,"tags":null}}}],"prefix":"all","page":2,"pageTotal":4,"itemTotal":39}}